[![Open In Colab](https://colab.research.google.com/assets/colab-badge.svg)](https://colab.research.google.com/github/mosleh-exeter/BEM1025/blob/main/ExamPrep/Exam1/MidTerm_ExamPrep_3-solutions.ipynb)

In [1]:
# we import the library pandas and give it the "pd" nickname
import pandas as pd
import numpy as np

### Assignment 4.1
#### (a) Create two variables called A1 and A2 in Python and assign them values of 5 and 9.
#### (b) Create variable C which holds the value of A1 divided by A2 and variable D that holds their multiplication.

#### Hint: You can do this using basic Python functionality without operations from Pandas

## (a)

In [2]:
A1=5
A2=9

In [3]:
# Here we define two variables and assign values 5 and 9. 
# In Python defining variables and assigning values can happen at the same time

## (b)

In [4]:
C=A1/A2
D=A1*A2
print(C,D)

0.5555555555555556 45

In [5]:
# Here we define two additional variables and 
# assign values of division and mulitplication of variables from previous steps to them

### You will work on the following dataframe for the rest of assignments
#### This dataset contains a subset of the fuel economy data that the EPA makes available on http://fueleconomy.gov. It contains only car models which had a new release every year between 1999 and 2008 - this was used as a proxy for the popularity of the car.:

manufacturer: manufacturer name; 

model: model name; 

displ: engine size in litres; 

year: year of manufacture; 

cyl: number of cylinders; 

trans: type of transmission; 

drv: the type of drive train where f = front-wheel drive, r = rear wheel drive, 4 = 4wd; 

cty: city miles per gallon; 

hwy: highway miles per gallon; 

fl:fuel type; 

class: "type" of car e.g. compact etc

In [6]:
df=pd.read_csv('https://www.dropbox.com/s/rx9ondhbqvd9zcm/mpg.csv?dl=1')
df.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
3         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
4         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 234 entries, 0 to 233
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 20.2+ KB

### Assignment 4.2
#### (a) Provide the list of column names, and number of rows in the dataframe
#### (b) Extract the columns "manufacturer", "model", and "year" (the outcome should have three columns not seperated single columns)
#### (c) Extract rows number 10, 20, 30, 35
#### (d) Extract columns "manufacturer", "year" and "class" for rows 100 and 200
#### (e) Provide the list of unique manufacturer (you need to remove duplicated manufacturers), Hint: you can consult pandas document: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.unique.html

## (a)

In [8]:
print(df.columns)
print(df.shape[0])

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'cty',
       'hwy', 'fl', 'class'],
      dtype='object')
234

In [9]:
# We use columns and use "shape" which returns a tuple representing the dimensionality of the DataFrame.

## (b)

In [10]:
df[['manufacturer','model','year']].head()

  manufacturer model  year
0         audi    a4  1999
1         audi    a4  1999
2         audi    a4  2008
3         audi    a4  2008
4         audi    a4  1999

In [11]:
# We use a list of columns as the input for column selection

## (c)

In [12]:
df.iloc[[9,19,29,34]]

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
9,audi,a4 quattro,2.0,2008,4,manual(m6),4,20,28,p,compact
19,chevrolet,c1500 suburban 2wd,5.3,2008,8,auto(l4),r,11,15,e,suv
29,chevrolet,k1500 tahoe 4wd,5.3,2008,8,auto(l4),4,11,14,e,suv
34,chevrolet,malibu,3.1,1999,6,auto(l4),f,18,26,r,midsize

In [13]:
# We use a list of rows and substract one from each since the index starts from zero, then use iloc to find the rows

## (d)

In [14]:
df[['manufacturer','year','class']].iloc[[99,199]]

    manufacturer  year       class
99         honda  1999  subcompact
199       toyota  2008         suv

In [15]:
# We use a list of rows and substract one from each since the index starts from zero, then use iloc to find the rows
# And combine it with selecting for the given list of columns

## (e)

In [16]:
df['manufacturer'].unique()

array(['audi', 'chevrolet', 'dodge', 'ford', 'honda', 'hyundai', 'jeep',
       'land rover', 'lincoln', 'mercury', 'nissan', 'pontiac', 'subaru',
       'toyota', 'volkswagen'], dtype=object)

In [17]:
# We use unique() function to find the list of unique() items from the manufacturer column

### Assignment 4.3
#### (a) Find the maximum size of engine
#### (b) Find the minimum mile per gallon in city across all cars
#### (c) Find the average mile per gallon on highway across all cars
#### (d) Create a new column in dataframe to normalize the mile per gallon on highway. You need to multiply mile per gallon on highway by engine size

## (a)

In [18]:
df['displ'].max()

7.0

In [19]:
# We use max() function to find the maximum value of displ across all datapoints

## (b)

In [20]:
df['cty'].min()

9

In [21]:
# We use min() function to find the minimum value of cty across all datapoints

## (c)

In [22]:
df['hwy'].mean()

23.44017094017094

In [23]:
# We use mean() function to find the average value of hwy across all datapoints

## (d)

In [24]:
df['new_col']=df['hwy']*df['displ']
df['new_col'].head()

0    52.2
1    52.2
2    62.0
3    60.0
4    72.8
Name: new_col, dtype: float64

In [25]:
# We create a new column by dividing the value of two existing columns

### Assignment 4.4
#### (a) Find cars that have either 4 or 9 cylinders 
#### (b) Find cars that have engine size between 4 and 5 (inclusive, you need to include 4 and 5)
#### (c) Find all suv cars manufactured by chevrolet except in 2008
#### (d) What is average mile per gallon on highway for all models of toyota 4runner manufactured in 1999?

## (a)

In [26]:
filter_cyl=(df['cyl']==4) | (df['cyl']==9)
df[filter_cyl].head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,new_col
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,52.2
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,52.2
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,62.0
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,60.0
7,audi,a4 quattro,1.8,1999,4,manual(m5),4,18,26,p,compact,46.8

In [27]:
# We combine two conditions where the value of cyl is exactly equals 4 or 9
# We first create a pandas serries which returs True if the condition holds and False otherwise
# We use the series as input for filtering

## (b)

In [28]:
filter_displ=(df['displ']>=4) & (df['displ']<=5)
df[filter_displ].head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,new_col
17,audi,a6 quattro,4.2,2008,8,auto(s6),4,16,23,p,midsize,96.6
47,dodge,caravan 2wd,4.0,2008,6,auto(l6),f,16,23,r,minivan,92.0
52,dodge,dakota pickup 4wd,4.7,2008,8,auto(l5),4,14,19,r,pickup,89.3
53,dodge,dakota pickup 4wd,4.7,2008,8,auto(l5),4,14,19,r,pickup,89.3
54,dodge,dakota pickup 4wd,4.7,2008,8,auto(l5),4,9,12,e,pickup,56.4

In [29]:
# We combine two conditions where the value of cyl is greater than or equal to 4 and less than or equal 5
# We first create a pandas serries which returs True if the condition holds and False otherwise
# We use the series as input for filtering

## (c)

In [30]:

filter_suv=(df['class']=='suv') & (df['manufacturer']=='chevrolet') & (df['year']!=2008)
df[filter_suv]

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,new_col
21,chevrolet,c1500 suburban 2wd,5.7,1999,8,auto(l4),r,13,17,r,suv,96.9
30,chevrolet,k1500 tahoe 4wd,5.7,1999,8,auto(l4),4,11,15,r,suv,85.5
31,chevrolet,k1500 tahoe 4wd,6.5,1999,8,auto(l4),4,14,17,d,suv,110.5

In [31]:
# First we create a pandas series by combining three conditions using "And" operator. 
# The first two conditions filter for exact value match, and the third conditions filter rows that do not match value
# Then feed the series as the input for filtering on rows.

## (d)

In [32]:
filter_toyota=(df['model'].str.contains('4runner')) & (df['manufacturer']=='toyota') & (df['year']==1999)
df[filter_toyota]['hwy'].mean()

19.0

In [33]:
# First we create a pandas series by combining three conditions using "And" operator
# The first condition filters for models that containt the exact case match of word 4runner, the other two for exact match
# Then feed the series as the input for filtering on rows.